In [1]:
!pip install requests bs4 scikit-learn tweepy kiwipiepy IPython

Collecting requests
  Using cached requests-2.32.3-py3-none-any.whl.metadata (4.6 kB)
Collecting bs4
  Using cached bs4-0.0.2-py2.py3-none-any.whl.metadata (411 bytes)
Collecting scikit-learn
  Downloading scikit_learn-1.6.1-cp311-cp311-win_amd64.whl.metadata (15 kB)
Collecting tweepy
  Downloading tweepy-4.15.0-py3-none-any.whl.metadata (4.1 kB)
Collecting kiwipiepy
  Downloading kiwipiepy-0.21.0-cp311-cp311-win_amd64.whl.metadata (1.3 kB)
Requirement already satisfied: IPython in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (9.2.0)
Collecting charset-normalizer<4,>=2 (from requests)
  Downloading charset_normalizer-3.4.2-cp311-cp311-win_amd64.whl.metadata (36 kB)
Collecting idna<4,>=2.5 (from requests)
  Using cached idna-3.10-py3-none-any.whl.metadata (10 kB)
Collecting urllib3<3,>=1.21.1 (from requests)
  Using cached urllib3-2.4.0-py3-none-any.whl.metadata (6.5 kB)
Collecting certifi>=2017.4.17 (from requests)
  Downloading certifi-2025.4.26-py3-none-any.whl.metadata (2.5 kB)
Collecting beautifulsoup4 (from bs4)
  Downloading beautifulsoup4-4.13.4-py3-none-any.whl.metadata (3.8 kB)
Collecting numpy>=1.19.5 (from scikit-learn)
  Downloading numpy-2.2.5-cp311-cp311-win_amd64.whl.metadata (60 kB)
Collecting scipy>=1.6.0 (from scikit-learn)
  Downloading scipy-1.15.2-cp311-cp311-win_amd64.whl.metadata (60 kB)
Collecting joblib>=1.2.0 (from scikit-learn)
  Downloading joblib-1.5.0-py3-none-any.whl.metadata (5.6 kB)
Collecting threadpoolctl>=3.1.0 (from scikit-learn)
  Downloading threadpoolctl-3.6.0-py3-none-any.whl.metadata (13 kB)
Collecting oauthlib<4,>=3.2.0 (from tweepy)
  Downloading oauthlib-3.2.2-py3-none-any.whl.metadata (7.5 kB)
Collecting requests-oauthlib<3,>=1.2.0 (from tweepy)
  Downloading requests_oauthlib-2.0.0-py2.py3-none-any.whl.metadata (11 kB)
Collecting kiwipiepy_model<0.22,>=0.21 (from kiwipiepy)
  Downloading kiwipiepy_model-0.21.0.tar.gz (35.5 MB)
     ---------------------------------------- 0.0/35.5 MB ? eta -:--:--
     -- ------------------------------------- 2.4/35.5 MB 11.2 MB/s eta 0:00:03
     ----- ---------------------------------- 4.7/35.5 MB 11.4 MB/s eta 0:00:03
     ------- -------------------------------- 7.1/35.5 MB 11.2 MB/s eta 0:00:03
     ---------- ----------------------------- 9.4/35.5 MB 11.3 MB/s eta 0:00:03
     ------------ -------------------------- 11.8/35.5 MB 11.4 MB/s eta 0:00:03
     --------------- ----------------------- 14.2/35.5 MB 11.2 MB/s eta 0:00:02
     ------------------ -------------------- 16.8/35.5 MB 11.4 MB/s eta 0:00:02
     --------------------- ----------------- 19.1/35.5 MB 11.3 MB/s eta 0:00:02
     ----------------------- --------------- 21.5/35.5 MB 11.3 MB/s eta 0:00:02
     -------------------------- ------------ 23.9/35.5 MB 11.3 MB/s eta 0:00:02
     ---------------------------- ---------- 26.2/35.5 MB 11.3 MB/s eta 0:00:01
     ------------------------------- ------- 28.8/35.5 MB 11.4 MB/s eta 0:00:01
     ---------------------------------- ---- 31.2/35.5 MB 11.3 MB/s eta 0:00:01
     ------------------------------------ -- 33.6/35.5 MB 11.3 MB/s eta 0:00:01
     --------------------------------------- 35.5/35.5 MB 11.2 MB/s eta 0:00:00
  Installing build dependencies: started
  Installing build dependencies: finished with status 'done'
  Getting requirements to build wheel: started
  Getting requirements to build wheel: finished with status 'done'
  Preparing metadata (pyproject.toml): started
  Preparing metadata (pyproject.toml): finished with status 'done'
Collecting tqdm (from kiwipiepy)
  Using cached tqdm-4.67.1-py3-none-any.whl.metadata (57 kB)
Requirement already satisfied: colorama in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from IPython) (0.4.6)
Requirement already satisfied: decorator in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from IPython) (5.2.1)
Requirement already satisfied: ipython-pygments-lexers in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from IPython) (1.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from IPython) (0.19.2)
Requirement already satisfied: matplotlib-inline in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from IPython) (0.1.7)
Requirement already satisfied: prompt_toolkit<3.1.0,>=3.0.41 in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from IPython) (3.0.51)
Requirement already satisfied: pygments>=2.4.0 in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from IPython) (2.19.1)
Requirement already satisfied: stack_data in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from IPython) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from IPython) (5.14.3)
Requirement already satisfied: typing_extensions>=4.6 in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from IPython) (4.13.2)
Requirement already satisfied: wcwidth in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from prompt_toolkit<3.1.0,>=3.0.41->IPython) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.4 in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from jedi>=0.16->IPython) (0.8.4)
Collecting soupsieve>1.2 (from beautifulsoup4->bs4)
  Downloading soupsieve-2.7-py3-none-any.whl.metadata (4.6 kB)
Requirement already satisfied: executing>=1.2.0 in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from stack_data->IPython) (2.2.0)
Requirement already satisfied: asttokens>=2.1.0 in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from stack_data->IPython) (3.0.0)
Requirement already satisfied: pure-eval in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from stack_data->IPython) (0.2.3)
Using cached requests-2.32.3-py3-none-any.whl (64 kB)
Downloading charset_normalizer-3.4.2-cp311-cp311-win_amd64.whl (105 kB)
Using cached idna-3.10-py3-none-any.whl (70 kB)
Using cached urllib3-2.4.0-py3-none-any.whl (128 kB)
Using cached bs4-0.0.2-py2.py3-none-any.whl (1.2 kB)
Downloading scikit_learn-1.6.1-cp311-cp311-win_amd64.whl (11.1 MB)
   ---------------------------------------- 0.0/11.1 MB ? eta -:--:--
   ------- -------------------------------- 2.1/11.1 MB 11.8 MB/s eta 0:00:01
   ---------------- ----------------------- 4.7/11.1 MB 11.4 MB/s eta 0:00:01
   ------------------------- -------------- 7.1/11.1 MB 11.5 MB/s eta 0:00:01
   --------------------------------- ------ 9.4/11.1 MB 11.3 MB/s eta 0:00:01
   ---------------------------------------- 11.1/11.1 MB 11.1 MB/s eta 0:00:00
Downloading tweepy-4.15.0-py3-none-any.whl (99 kB)
Downloading oauthlib-3.2.2-py3-none-any.whl (151 kB)
Downloading requests_oauthlib-2.0.0-py2.py3-none-any.whl (24 kB)
Downloading kiwipiepy-0.21.0-cp311-cp311-win_amd64.whl (2.4 MB)
   ---------------------------------------- 0.0/2.4 MB ? eta -:--:--
   ---------------------------------------  2.4/2.4 MB 11.2 MB/s eta 0:00:01
   ---------------------------------------- 2.4/2.4 MB 10.6 MB/s eta 0:00:00
Downloading certifi-2025.4.26-py3-none-any.whl (159 kB)
Downloading joblib-1.5.0-py3-none-any.whl (307 kB)
Downloading numpy-2.2.5-cp311-cp311-win_amd64.whl (12.9 MB)
   ---------------------------------------- 0.0/12.9 MB ? eta -:--:--
   ------- -------------------------------- 2.4/12.9 MB 11.2 MB/s eta 0:00:01
   -------------- ------------------------- 4.7/12.9 MB 11.4 MB/s eta 0:00:01
   --------------------- ------------------ 7.1/12.9 MB 11.5 MB/s eta 0:00:01
   ----------------------------- ---------- 9.4/12.9 MB 11.3 MB/s eta 0:00:01
   ------------------------------------ --- 11.8/12.9 MB 11.4 MB/s eta 0:00:01
   ---------------------------------------- 12.9/12.9 MB 11.1 MB/s eta 0:00:00
Downloading scipy-1.15.2-cp311-cp311-win_amd64.whl (41.2 MB)
   ---------------------------------------- 0.0/41.2 MB ? eta -:--:--
   -- ------------------------------------- 2.4/41.2 MB 11.2 MB/s eta 0:00:04
   ---- ----------------------------------- 4.7/41.2 MB 11.4 MB/s eta 0:00:04
   ------ --------------------------------- 7.1/41.2 MB 11.5 MB/s eta 0:00:03
   --------- ------------------------------ 9.4/41.2 MB 11.3 MB/s eta 0:00:03
   ----------- ---------------------------- 12.1/41.2 MB 11.4 MB/s eta 0:00:03
   ------------- -------------------------- 14.4/41.2 MB 11.3 MB/s eta 0:00:03
   ---------------- ----------------------- 16.8/41.2 MB 11.4 MB/s eta 0:00:03
   ------------------ --------------------- 19.1/41.2 MB 11.4 MB/s eta 0:00:02
   --------------------- ------------------ 21.8/41.2 MB 11.4 MB/s eta 0:00:02
   ----------------------- ---------------- 24.1/41.2 MB 11.4 MB/s eta 0:00:02
   ------------------------- -------------- 26.5/41.2 MB 11.3 MB/s eta 0:00:02
   --------------------------- ------------ 28.8/41.2 MB 11.4 MB/s eta 0:00:02
   ------------------------------ --------- 31.5/41.2 MB 11.3 MB/s eta 0:00:01
   -------------------------------- ------- 33.8/41.2 MB 11.4 MB/s eta 0:00:01
   ----------------------------------- ---- 36.2/41.2 MB 11.4 MB/s eta 0:00:01
   ------------------------------------- -- 38.5/41.2 MB 11.3 MB/s eta 0:00:01
   ---------------------------------------  41.2/41.2 MB 11.4 MB/s eta 0:00:01
   ---------------------------------------- 41.2/41.2 MB 11.2 MB/s eta 0:00:00
Downloading threadpoolctl-3.6.0-py3-none-any.whl (18 kB)
Downloading beautifulsoup4-4.13.4-py3-none-any.whl (187 kB)
Downloading soupsieve-2.7-py3-none-any.whl (36 kB)
Using cached tqdm-4.67.1-py3-none-any.whl (78 kB)
Building wheels for collected packages: kiwipiepy_model
  Building wheel for kiwipiepy_model (pyproject.toml): started
  Building wheel for kiwipiepy_model (pyproject.toml): finished with status 'done'
  Created wheel for kiwipiepy_model: filename=kiwipiepy_model-0.21.0-py3-none-any.whl size=35593254 sha256=1346bd13ede667a374616c0b15b483892fa534bb3ac8023dd88e80376d5e2c90
  Stored in directory: c:\users\tpals\appdata\local\pip\cache\wheels\b0\16\3d\95053ab5298f0f0f22ffea6de0200b6f24bffb73cab4c1a828
Successfully built kiwipiepy_model
Installing collected packages: kiwipiepy_model, urllib3, tqdm, threadpoolctl, soupsieve, oauthlib, numpy, joblib, idna, charset-normalizer, certifi, scipy, requests, kiwipiepy, beautifulsoup4, scikit-learn, requests-oauthlib, bs4, tweepy

   ----------------------------------------  0/19 [kiwipiepy_model]
   -- -------------------------------------  1/19 [urllib3]
   -- -------------------------------------  1/19 [urllib3]
   ---- -----------------------------------  2/19 [tqdm]
   ---- -----------------------------------  2/19 [tqdm]
   -------- -------------------------------  4/19 [soupsieve]
   ---------- -----------------------------  5/19 [oauthlib]
   ---------- -----------------------------  5/19 [oauthlib]
   ---------- -----------------------------  5/19 [oauthlib]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   ------------ ---------------------------  6/19 [numpy]
   -------------- -------------------------  7/19 [joblib]
   -------------- -------------------------  7/19 [joblib]
   -------------- -------------------------  7/19 [joblib]
   -------------- -------------------------  7/19 [joblib]
   ---------------- -----------------------  8/19 [idna]
   ------------------ ---------------------  9/19 [charset-normalizer]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ----------------------- ---------------- 11/19 [scipy]
   ------------------------- -------------- 12/19 [requests]
   --------------------------- ------------ 13/19 [kiwipiepy]
   ----------------------------- ---------- 14/19 [beautifulsoup4]
   ----------------------------- ---------- 14/19 [beautifulsoup4]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------- -------- 15/19 [scikit-learn]
   ------------------------------------- -- 18/19 [tweepy]

In [2]:
!pip install scipy numpy matplotlib seaborn statsmodels openpyxl

Requirement already satisfied: scipy in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (1.15.2)
Requirement already satisfied: numpy in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (2.2.5)
Collecting matplotlib
  Downloading matplotlib-3.10.1-cp311-cp311-win_amd64.whl.metadata (11 kB)
Collecting seaborn
  Downloading seaborn-0.13.2-py3-none-any.whl.metadata (5.4 kB)
Collecting statsmodels
  Downloading statsmodels-0.14.4-cp311-cp311-win_amd64.whl.metadata (9.5 kB)
Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting contourpy>=1.0.1 (from matplotlib)
  Downloading contourpy-1.3.2-cp311-cp311-win_amd64.whl.metadata (5.5 kB)
Collecting cycler>=0.10 (from matplotlib)
  Using cached cycler-0.12.1-py3-none-any.whl.metadata (3.8 kB)
Collecting fonttools>=4.22.0 (from matplotlib)
  Downloading fonttools-4.57.0-cp311-cp311-win_amd64.whl.metadata (104 kB)
Collecting kiwisolver>=1.3.1 (from matplotlib)
  Downloading kiwisolver-1.4.8-cp311-cp311-win_amd64.whl.metadata (6.3 kB)
Requirement already satisfied: packaging>=20.0 in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from matplotlib) (25.0)
Collecting pillow>=8 (from matplotlib)
  Downloading pillow-11.2.1-cp311-cp311-win_amd64.whl.metadata (9.1 kB)
Collecting pyparsing>=2.3.1 (from matplotlib)
  Downloading pyparsing-3.2.3-py3-none-any.whl.metadata (5.0 kB)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from matplotlib) (2.9.0.post0)
Collecting pandas>=1.2 (from seaborn)
  Downloading pandas-2.2.3-cp311-cp311-win_amd64.whl.metadata (19 kB)
Collecting patsy>=0.5.6 (from statsmodels)
  Downloading patsy-1.0.1-py2.py3-none-any.whl.metadata (3.3 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Collecting pytz>=2020.1 (from pandas>=1.2->seaborn)
  Using cached pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas>=1.2->seaborn)
  Using cached tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\tpals\onedrive\documents\github\dataanalysispython\.venv\lib\site-packages (from python-dateutil>=2.7->matplotlib) (1.17.0)
Downloading matplotlib-3.10.1-cp311-cp311-win_amd64.whl (8.1 MB)
   ---------------------------------------- 0.0/8.1 MB ? eta -:--:--
   ---------- ----------------------------- 2.1/8.1 MB 11.8 MB/s eta 0:00:01
   ---------------------- ----------------- 4.5/8.1 MB 11.2 MB/s eta 0:00:01
   ----------------------------------- ---- 7.1/8.1 MB 11.5 MB/s eta 0:00:01
   ---------------------------------------- 8.1/8.1 MB 11.1 MB/s eta 0:00:00
Downloading seaborn-0.13.2-py3-none-any.whl (294 kB)
Downloading statsmodels-0.14.4-cp311-cp311-win_amd64.whl (9.9 MB)
   ---------------------------------------- 0.0/9.9 MB ? eta -:--:--
   --------- ------------------------------ 2.4/9.9 MB 11.2 MB/s eta 0:00:01
   ------------------- -------------------- 4.7/9.9 MB 11.4 MB/s eta 0:00:01
   ---------------------------- ----------- 7.1/9.9 MB 11.5 MB/s eta 0:00:01
   -------------------------------------- - 9.4/9.9 MB 11.5 MB/s eta 0:00:01
   ---------------------------------------- 9.9/9.9 MB 11.2 MB/s eta 0:00:00
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Downloading contourpy-1.3.2-cp311-cp311-win_amd64.whl (222 kB)
Using cached cycler-0.12.1-py3-none-any.whl (8.3 kB)
Downloading fonttools-4.57.0-cp311-cp311-win_amd64.whl (2.2 MB)
   ---------------------------------------- 0.0/2.2 MB ? eta -:--:--
   ---------------------------------------- 2.2/2.2 MB 10.4 MB/s eta 0:00:00
Downloading kiwisolver-1.4.8-cp311-cp311-win_amd64.whl (71 kB)
Downloading pandas-2.2.3-cp311-cp311-win_amd64.whl (11.6 MB)
   ---------------------------------------- 0.0/11.6 MB ? eta -:--:--
   ------- -------------------------------- 2.1/11.6 MB 10.7 MB/s eta 0:00:01
   ---------------- ----------------------- 4.7/11.6 MB 11.0 MB/s eta 0:00:01
   ------------------------ --------------- 7.1/11.6 MB 11.2 MB/s eta 0:00:01
   -------------------------------- ------- 9.4/11.6 MB 11.3 MB/s eta 0:00:01
   ---------------------------------------- 11.6/11.6 MB 11.0 MB/s eta 0:00:00
Downloading patsy-1.0.1-py2.py3-none-any.whl (232 kB)
Downloading pillow-11.2.1-cp311-cp311-win_amd64.whl (2.7 MB)
   ---------------------------------------- 0.0/2.7 MB ? eta -:--:--
   ----------------------------------- ---- 2.4/2.7 MB 11.2 MB/s eta 0:00:01
   ---------------------------------------- 2.7/2.7 MB 11.0 MB/s eta 0:00:00
Downloading pyparsing-3.2.3-py3-none-any.whl (111 kB)
Using cached pytz-2025.2-py2.py3-none-any.whl (509 kB)
Using cached tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: pytz, tzdata, pyparsing, pillow, patsy, kiwisolver, fonttools, et-xmlfile, cycler, contourpy, pandas, openpyxl, matplotlib, statsmodels, seaborn

   ----------------------------------------  0/15 [pytz]
   ----------------------------------------  0/15 [pytz]
   -- -------------------------------------  1/15 [tzdata]
   -- -------------------------------------  1/15 [tzdata]
   -- -------------------------------------  1/15 [tzdata]
   ----- ----------------------------------  2/15 [pyparsing]
   -------- -------------------------------  3/15 [pillow]
   -------- -------------------------------  3/15 [pillow]
   -------- -------------------------------  3/15 [pillow]
   -------- -------------------------------  3/15 [pillow]
   -------- -------------------------------  3/15 [pillow]
   -------- -------------------------------  3/15 [pillow]
   ---------- -----------------------------  4/15 [patsy]
   ---------- -----------------------------  4/15 [patsy]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ---------------- -----------------------  6/15 [fonttools]
   ------------------------ ---------------  9/15 [contourpy]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   -------------------------- ------------- 10/15 [pandas]
   ----------------------------- ---------- 11/15 [openpyxl]
   ----------------------------- ---------- 11/15 [openpyxl]
   ----------------------------- ---------- 11/15 [openpyxl]
   ----------------------------- ---------- 11/15 [openpyxl]
   ----------------------------- ---------- 11/15 [openpyxl]
   ----------------------------- ---------- 11/15 [openpyxl]
   ----------------------------- ---------- 11/15 [openpyxl]
   ----------------------------- ---------- 11/15 [openpyxl]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   -------------------------------- ------- 12/15 [matplotlib]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ---------------------------------- ----- 13/15 [statsmodels]
   ------------------------------------- -- 14/15 [seaborn]
   ------------------------------------- -- 14/15 [seaborn]
   ------------------------------------- -- 14/15 [seaborn]
   ------------------------------------- -- 14/15 [seaborn]
   ---------------------------------------- 15/15 [seaborn]

Successfully installed contourpy-1.3.2 cycler-0.12.1 et-xmlfile-2.0.0 fonttools-4.57.0 kiwisolver-1.4.8 matplotlib-3.10.1 openpyxl-3.1.5 pandas-2.2.3 patsy-1.0.1 pillow-11.2.1 pyparsing-3.2.3 pytz-2025.2 seaborn-0.13.2 statsmodels-0.14.4 tzdata-2025.2

In [4]:
import pandas as pd

sample_data = {"a":[4,5,6],
               "b":[7,8,9],
               "c":[10,11,12]}

df = pd.DataFrame(sample_data)
df_index = pd.DataFrame(sample_data, index=[1,2,3])

In [4]:
df

   a  b   c
0  4  7  10
1  5  8  11
2  6  9  12

## PIVOT 실습
1. 데이터를 추출

In [5]:
df_1 = pd.DataFrame(
    [[4, 7, 10],
     [5, 8, 11],
     [6, 9, 12]],
     index=[1, 2, 3],
     columns=['a', 'b', 'c']
)

In [6]:
df_1

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [7]:
df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two', 'two'],
                   'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'baz': [1, 2, 3, 4, 5, 6],
                   'zoo': ['x', 'y', 'z', 'q', 'w', 't']})

df

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [8]:
df.pivot(index='foo', columns='bar', values='baz')

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [9]:
df.pivot(index='foo', columns='bar', values=['baz', 'zoo'])

    baz       zoo
bar   A  B  C   A  B  C
foo
one   1  2  3   x  y  z
two   4  5  6   q  w  t

## CONCAT 실습
1. 데이터를 합칠 때 사용하는 함수 중 하나
2. 열 이름이 서로 일치하면 밑으로 연결됨.

3. 합쳐야 할 데이터프레임끼리 열 이름이 서로 일치하지 않다면 결측치로 처리함

In [10]:
data1 = [['a',1],
         ['b', 2]]
data2 = [['c',3],
         ['d', 4]]

df1 = pd.DataFrame(data1, columns=['letter', 'number'])
df2 = pd.DataFrame(data2, columns=['letter', 'number'])

display(df1)
display(df2)

  letter  number
0      a       1
1      b       2

  letter  number
0      c       3
1      d       4

In [11]:
pd.concat([df1, df2])

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [12]:
df3 = pd.DataFrame([['e', 5, 'cat'], ['f', 6, 'dog']], columns=['letter', 'number', 'animal'])
pd.concat([df1, df3])

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      e       5    cat
1      f       6    dog

In [13]:
pd.concat([df1, df3], join="inner")

  letter  number
0      a       1
1      b       2
0      e       5
1      f       6

In [14]:
df4 = pd.DataFrame([['bird' ,'polly'], ['monkey' ,'george']], columns=['animal' ,'name'])
df4

   animal    name
0    bird   polly
1  monkey  george

In [15]:
#가로 방향으로 합치기 axis=1
pd.concat([df1, df4], axis=1)

  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

## sort_value()
1. 데이터를 정렬

In [16]:
import numpy as np

df = pd.DataFrame({
    'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],
    'col2': [2, 1, 9, 8, 7, 4],
    'col3': [0, 1, 9, 4, 2, 3],
    'col4': ['a', 'B', 'c', 'D', 'e', 'F']
})
display(df)

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F

In [17]:
df.sort_values(by=['col1'])

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D

In [18]:
df.sort_values(by=['col1'], ascending=False)

  col1  col2  col3 col4
4    D     7     2    e
5    C     4     3    F
2    B     9     9    c
0    A     2     0    a
1    A     1     1    B
3  NaN     8     4    D

In [19]:
df.sort_values(by=['col1', 'col2'])

  col1  col2  col3 col4
1    A     1     1    B
0    A     2     0    a
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D

In [20]:
df.sort_values(by='col1', ascending=False, na_position='first')

  col1  col2  col3 col4
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F
2    B     9     9    c
0    A     2     0    a
1    A     1     1    B

## 인덱스 재정렬

In [21]:
df = pd.DataFrame([1, 2, 3, 4, 5], index=[100, 29, 234, 1, 150], columns=['A'])
df

     A
100  1
29   2
234  3
1    4
150  5

In [22]:
df.sort_index()

     A
1    4
29   2
100  1
150  5
234  3

In [23]:
df.sort_index(ascending=False)

     A
234  3
150  5
100  1
29   2
1    4

In [27]:
#reset_index()
df = pd.DataFrame([('bird', 389.0),
                   ('bird', 24.0),
                   ('mammal', 80.5),
                   ('mammal', np.nan)],
                   index=['falcon', 'parrot', 'lion', 'monkey'],
                   columns=('class', 'max_speed'))

df

         class  max_speed
falcon    bird      389.0
parrot    bird       24.0
lion    mammal       80.5
monkey  mammal        NaN

In [30]:
df.reset_index()
#기존 인덱스가 열로 이동

    index   class  max_speed
0  falcon    bird      389.0
1  parrot    bird       24.0
2    lion  mammal       80.5
3  monkey  mammal        NaN

In [28]:
df.reset_index(drop=True)

    class  max_speed
0    bird      389.0
1    bird       24.0
2  mammal       80.5
3  mammal        NaN

## 값을 지우는 drop(), dropna()

In [31]:
df = pd.DataFrame(np.arange(12).reshape(3, 4), columns=['A', 'B', 'C', 'D'])
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [32]:
df.drop(columns=['B', 'C'])

   A   D
0  0   3
1  4   7
2  8  11

In [33]:
df.drop([0, 1])

   A  B   C   D
2  8  9  10  11

In [34]:
df.drop(index=[0, 1], columns=['B', 'C'])

   A   D
2  8  11

In [35]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy":[np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [np.nan, "1940-04-25", np.nan]})
df

       name        toy        born
0    Alfred        NaN         NaN
1    Batman  Batmobile  1940-04-25
2  Catwoman   Bullwhip         NaN

In [36]:
df.dropna()

     name        toy        born
1  Batman  Batmobile  1940-04-25

In [37]:
df.dropna(axis=1)

       name
0    Alfred
1    Batman
2  Catwoman

In [38]:
df.dropna(subset=['name', 'toy'])

       name        toy        born
1    Batman  Batmobile  1940-04-25
2  Catwoman   Bullwhip         NaN

#  데이터 추출
- 단순하게 데이터를 정리할 목적으로만 추출

In [5]:
df = pd.DataFrame({"ID": [1, 2, 3, 3, 5],
                   "국어": [80, 90, 75, 75, 90],
                   "영어": [85, 100, 70, 70, 95],
                   "수학": [75, 95, 65, 65, 80]})
df

   ID  국어   영어  수학
0   1  80   85  75
1   2  90  100  95
2   3  75   70  65
3   3  75   70  65
4   5  90   95  80

In [40]:
df[['국어', '영어']]

   국어   영어
0  80   85
1  90  100
2  75   70
3  75   70
4  90   95

In [19]:
df[df['국어'] > 80]

   ID  국어   영어  수학
1   2  90  100  95
4   5  90   95  80

In [18]:
df['국어'] > 80

0    False
1     True
2    False
3    False
4     True
Name: 국어, dtype: bool

In [16]:
df.drop_duplicates()

   ID  국어   영어  수학
0   1  80   85  75
1   2  90  100  95
2   3  75   70  65
4   5  90   95  80

In [15]:
df.drop_duplicates(subset='국어')

   ID  국어   영어  수학
0   1  80   85  75
1   2  90  100  95
2   3  75   70  65

In [14]:
df.head(2)

   ID  국어   영어  수학
0   1  80   85  75
1   2  90  100  95

In [13]:
df.tail(2)

   ID  국어  영어  수학
3   3  75  70  65
4   5  90  95  80

In [10]:
df.sample(2)

   ID  국어  영어  수학
2   3  75  70  65
4   5  90  95  80

In [7]:
df.sample(frac=0.5)

   ID  국어  영어  수학
2   3  75  70  65
0   1  80  85  75

# iloc[]와 loc[]
1. iloc와 loc도 데이터를 행을 기준으로 추출할 때 사용하는 함수이다.
2. 이 둘의 차이점은 iloc[]는 번호를 사용해서 데이터를 추출할 인덱스와 열을 지정하고
3. loc[]는 열 이름을 지정한다.
4. iloc[행 시작 번호:행 종료 번호, 열 시작 번호:열 종료 번호]

In [29]:
df.iloc[0,2]

np.int64(85)

In [21]:
df.iloc[1:3]

   ID  국어   영어  수학
1   2  90  100  95
2   3  75   70  65

In [22]:
df.iloc[:,:]

   ID  국어   영어  수학
0   1  80   85  75
1   2  90  100  95
2   3  75   70  65
3   3  75   70  65
4   5  90   95  80

In [30]:
df.iloc[1:4,:]

   ID  국어   영어  수학
1   2  90  100  95
2   3  75   70  65
3   3  75   70  65

In [36]:
df.iloc[1:4,:0]

Empty DataFrame
Columns: []
Index: [1, 2, 3]

In [32]:
df.loc[:,['국어','영어']]

   국어   영어
0  80   85
1  90  100
2  75   70
3  75   70
4  90   95

In [35]:
df.loc[:0, ['국어','영어']]

   국어  영어
0  80  85

In [37]:
df.loc[df['국어']>=80, ['국어','수학']]

   국어  수학
0  80  75
1  90  95
4  90  80